m-okada/QV08/emu/ARM/kinetis_workspace/t02/SDK/platform/hal/src/mcg/fsl_mcg_hal.c
    mcgpll1clk = CLOCK_HAL_GetPll1RefFreq(base);

    divider = (FSL_FEATURE_MCG_PLL_PRDIV_BASE + MCG_BRD_C11_PRDIV1(base));

    /* Calculate the PLL reference clock*/
    mcgpll1clk /= divider;
    divider = (MCG_BRD_C12_VDIV1(base) + FSL_FEATURE_MCG_PLL_VDIV_BASE);

    /* Calculate the MCG output clock*/
    mcgpll1clk = (mcgpll1clk * divider); /* divided by 2*/
#if FSL_FEATURE_MCG_HAS_PLL_INTERNAL_DIV
    mcgpll1clk >>= 1U;
#endif
    return mcgpll1clk;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : CLOCK_HAL_EnablePll1InFllMode
 * Description   : Enable PLL1 when MCG is in FLL mode.
 *
 *END**************************************************************************/
void CLOCK_HAL_EnablePll1InFllMode(MCG_Type * base,
                                   uint8_t prdiv,
                                   uint8_t vdiv,
                                   bool enableInStop)
{
    MCG_WR_C12_VDIV1(base, vdiv);
    MCG_WR_C11(base, (MCG_RD_C11(base)
                  & ~(MCG_C11_PLLSTEN1_MASK | MCG_C11_PRDIV1_MASK))
                  |   MCG_C11_PLLCLKEN1_MASK
                  |   MCG_C11_PLLSTEN1(enableInStop)
                  |   MCG_C11_PRDIV1(prdiv));
    while(!CLOCK_HAL_IsPll1Locked(base)) {} // Wait until locked.
}
#endif

#if FSL_FEATURE_MCG_HAS_EXTERNAL_PLL
/*FUNCTION**********************************************************************
 *
 * Function Name : CLOCK_HAL_GetExtPllClk
 * Description   : Get the current external pll clock.
 *
 *END**************************************************************************/
uint32_t CLOCK_HAL_GetExtPllClk(MCG_Type * base)
{
    return g_extPllClkFreq;
}
#endif

/*FUNCTION**********************************************************************
 *
 * Function Name : CLOCK_HAL_GetInternalRefClk
 * Description   : Get the current mcg internal reference clock (MCGIRCLK)
 * This function will return the mcgirclk value in frequency(hz) based
 * on current mcg configurations and settings. It will not check if the
 * mcgirclk is enabled or not, just calculate and return the value.
 *
 *END**************************************************************************/
uint32_t CLOCK_HAL_GetInternalRefClk(MCG_Type * base)
{
    uint32_t mcgirclk;

    if (!MCG_BRD_C1_IRCLKEN(base))
    {
        return 0U;
    }

    if (MCG_BRD_C2_IRCS(base) == kMcgIrcSlow)
    {
        /* Slow internal reference clock selected*/
        mcgirclk = g_slowInternalRefClkFreq;
    }
    else
    {
        mcgirclk = g_fastInternalRefClkFreq >> MCG_BRD_SC_FCRDIV(base);
    }
    return mcgirclk;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : CLOCK_HAL_GetFixedFreqClk
 * Description   : Get the MCGFFCLK frequency.
 * This function get the MCGFFCLK, it is only valid when its frequency is not
 * more than MCGOUTCLK/8. If MCGFFCLK is invalid, this function returns 0.
 *
 *END**************************************************************************/
uint32_t CLOCK_HAL_GetFixedFreqClk(MCG_Type * base)
{
    uint32_t freq = CLOCK_HAL_GetFllRefClk(base);

    /* MCGFFCLK must be no more than MCGOUTCLK/8. */
    if ((freq) && (freq <= (CLOCK_HAL_GetOutClk(base)/8U)))
    {
        return freq;
    }
    else
    {
        return 0U;
    }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : CLOCK_HAL_GetOutclk
 * Description   : Get the current mcg out clock
 * This function will return the mcgoutclk value in frequency(hz) based on
 * current mcg configurations and settings. The configuration should be
 * properly done in order to get the valid value.
 *
 *END**************************************************************************/
uint32_t CLOCK_HAL_GetOutClk(MCG_Type * base)
{
    uint32_t mcgoutclk;
    mcg_clkout_stat_t src = CLOCK_HAL_GetClkOutStat(base);

    switch (src)
    {
#if FSL_FEATURE_MCG_HAS_PLL
        case kMcgClkOutStatPll:
#if FSL_FEATURE_MCG_HAS_PLL1
            if (CLOCK_HAL_GetPllClkSelMode(base) == kMcgPllClkSelPll1)
            {
                mcgoutclk = CLOCK_HAL_GetPll1Clk(base);
            }
            else
#endif
#if FSL_FEATURE_MCG_HAS_EXTERNAL_PLL
            if (CLOCK_HAL_GetPllClkSelMode(base) == kMcgPllClkSelExtPll)
            {
                mcgoutclk = CLOCK_HAL_GetExtPllClk(base);
            }
            else
#endif
            {
                mcgoutclk = CLOCK_HAL_GetPll0Clk(base);
            }
            break;
#endif                                
        case kMcgClkOutStatFll:
            mcgoutclk = CLOCK_HAL_GetFllClk(base);
            break;
        case kMcgClkOutStatInternal:  /* Internal clock. */
            mcgoutclk = CLOCK_HAL_GetInternalRefClk(base);
            break;
        case kMcgClkOutStatExternal:  /* External clock. */
            mcgoutclk = CLOCK_HAL_GetMcgExternalClkFreq(base);
            break;
        default:
            mcgoutclk = 0U;
            break;
    }
    return mcgoutclk;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : CLOCK_HAL_SetOsc0Mode
 * Description   : Set the OSC0 work mode.
 * This function set OSC0 work mode, include frequency range select, high gain
 * oscillator select and external reference select.
 *
 *END**************************************************************************/
void CLOCK_HAL_SetOsc0Mode(MCG_Type * base,
                           osc_range_t range,
                           osc_gain_t hgo,
                           osc_src_t erefs)
{
    MCG_WR_C2(base, (MCG_RD_C2(base)
                  & ~(MCG_C2_RANGE_MASK  |
                      MCG_C2_HGO_MASK    |
                      MCG_C2_EREFS_MASK))
                  |  (MCG_C2_RANGE(range)|
                      MCG_C2_HGO(hgo)    |
                      MCG_C2_EREFS(erefs)));
}

/*FUNCTION**********************************************************************
 *
 * Function Name : CLOCK_HAL_EnableOsc0Monitor
 * Description   : Enable the OSC0 external clock monitor.
 *
 *END**************************************************************************/
void CLOCK_HAL_EnableOsc0Monitor(MCG_Type * base, mcg_osc_monitor_mode_t mode)
{
    MCG_BWR_C2_LOCRE0(base, mode);
    MCG_BWR_C6_CME0(base, 1U);
}

#if FSL_FEATURE_MCG_HAS_RTC_32K
/*FUNCTION**********************************************************************
 *
 * Function Name : CLOCK_HAL_EnableRtcOscMonitor
 * Description   : Enable the RTC OSC external clock monitor.
 *
 *END**************************************************************************/
void CLOCK_HAL_EnableRtcOscMonitor(MCG_Type * base, mcg_osc_monitor_mode_t mode)
{
    MCG_BWR_C8_LOCRE1(base, mode);
    MCG_BWR_C8_CME1(base, 1U);
}
#endif

