m-okada/QV08/emu/ARM/kinetis_workspace/t02/SDK/platform/hal/src/mcg/fsl_mcg_hal.c
#if FSL_FEATURE_MCG_HAS_OSC1
/*FUNCTION**********************************************************************
 *
 * Function Name : CLOCK_HAL_SetOsc1Mode
 * Description   : Set the OSC1 work mode.
 * This function set OSC1 work mode, include frequency range select, high gain
 * oscillator select and external reference select.
 *
 *END**************************************************************************/
void CLOCK_HAL_SetOsc1Mode(MCG_Type * base,
                           osc_range_t range,
                           osc_gain_t hgo,
                           osc_src_t erefs)
{
    MCG_WR_C10(base, (MCG_RD_C10(base)
                  & ~(MCG_C10_RANGE1_MASK  |
                      MCG_C10_HGO1_MASK    |
                      MCG_C10_EREFS1_MASK))
                  |  (MCG_C10_RANGE1(range)|
                      MCG_C10_HGO1(hgo)    |
                      MCG_C10_EREFS1(erefs)));
}

/*FUNCTION**********************************************************************
 *
 * Function Name : CLOCK_HAL_EnableOsc1Monitor
 * Description   : Enable the OSC1 external clock monitor.
 *
 *END**************************************************************************/
void CLOCK_HAL_EnableOsc1Monitor(MCG_Type * base, mcg_osc_monitor_mode_t mode)
{
    MCG_BWR_C10_LOCRE2(base, mode);
    MCG_BWR_C12_CME2(base, 1U);
}
#endif

#if FSL_FEATURE_MCG_HAS_EXTERNAL_PLL
/*FUNCTION**********************************************************************
 *
 * Function Name : CLOCK_HAL_EnableExtPllMonitor
 * Description   : Enable the External PLL clock monitor.
 *
 *END**************************************************************************/
void CLOCK_HAL_EnableExtPllMonitor(MCG_Type * base, mcg_osc_monitor_mode_t mode)
{
    MCG_BWR_C9_PLL_LOCRE(base, mode);
    MCG_BWR_C9_PLL_CME(base, 1U);
}
#endif

/*FUNCTION**********************************************************************
 *
 * Function Name : CLOCK_HAL_TrimInternalRefClk
 * Description   : Trim internal reference clock to a desire frequency.
 * The external frequency is the BUS clock frequency and must be in the range
 * of 8MHz to 16MHz.
 *
 *END**************************************************************************/
mcg_atm_error_t CLOCK_HAL_TrimInternalRefClk(MCG_Type* base,
                                             uint32_t  extFreq,
                                             uint32_t  desireFreq,
                                             uint32_t* actualFreq,
                                             mcg_atm_select_t atms)
{
    uint32_t multi;    /* extFreq / desireFreq */
    uint32_t actv;     /* Auto trim value. */

    if ((extFreq > kMcgConstant16000000) ||
        (extFreq < kMcgConstant8000000))
    {
        return kMcgAtmErrorBusClockRange;
    }

    /* Check desired frequency range. */
    if (kMcgAtmSel4m == atms)
    {
        if ((desireFreq < 3000000U) || (desireFreq > 5000000U))
        {
            return kMcgAtmErrorDesireFreqRange;
        }
    }
    else
    {
        if ((desireFreq < 31250U) || (desireFreq > 39063U))
        {
            return kMcgAtmErrorDesireFreqRange;
        }
    }

    /*
     * Make sure internal reference clock is not used to generate bus clock.
     * Just need to check C1[IREFS].
     */
    if (kMcgFllSrcInternal == MCG_BRD_C1_IREFS(base))
    {
        return kMcgAtmErrorIrcUsed;
    }

    multi  = extFreq / desireFreq;
    actv = multi * 21U;

    if (kMcgAtmSel4m == atms)
    {
        actv *= 128U;
    }

    /* Now begin to start trim. */
    MCG_WR_ATCVL(base, (actv & 0xFFU));
    MCG_WR_ATCVH(base, ((actv >> 8U) & 0xFFU));

    MCG_BWR_SC_ATMS(base, atms);

    MCG_BWR_SC_ATME(base, 1U);

    while (MCG_BRD_SC_ATME(base)) {}

    /* Error occurs? */
    if (CLOCK_HAL_IsAutoTrimMachineFailed(base))
    {
        return kMcgAtmErrorHardwareFail;
    }

    *actualFreq = extFreq / multi;

    if (kMcgAtmSel4m == atms)
    {
        g_fastInternalRefClkFreq = *actualFreq;
    }
    else
    {
        g_slowInternalRefClkFreq = *actualFreq;
    }

    return kMcgAtmErrorNone;
}
#endif

/*******************************************************************************
 * EOF
 ******************************************************************************/

